patch/soapLog.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.mercurypay.com/"><SOAP-ENV:Body><ns1:InitializeCardInfo><ns1:request><ns1:MerchantID>870380001</ns1:MerchantID><ns1:Password></ns1:Password><ns1:Frequency>OneTime</ns1:Frequency><ns1:ProcessCompleteUrl>http://localhost/hhk/house/GuestEdit.php?id=972&amp;psg=97</ns1:ProcessCompleteUrl><ns1:ReturnUrl>http://localhost/hhk/house/GuestEdit.php?id=972&amp;psg=97</ns1:ReturnUrl><ns1:DisplayStyle>Custom</ns1:DisplayStyle><ns1:LogoUrl>http://localhost/hhk/images/hostpaylogo.jpg</ns1:LogoUrl><ns1:PageTitle>Hospitality HouseKeeper</ns1:PageTitle><ns1:DefaultSwipe>Swipe</ns1:DefaultSwipe><ns1:CardHolderName></ns1:CardHolderName><ns1:OperatorID>test</ns1:OperatorID><ns1:CardEntryMethod>Both</ns1:CardEntryMethod></ns1:request></ns1:InitializeCardInfo></SOAP-ENV:Body></SOAP-ENV:Envelope>
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><InitializeCardInfoResponse xmlns="http://www.mercurypay.com/"><InitializeCardInfoResult><ResponseCode>100</ResponseCode><CardID /><Message>MerchantID and/or Password not received. Note that field names are case sensitive.</Message></InitializeCardInfoResult></InitializeCardInfoResponse></soap:Body></soap:Envelope>